Dataset/Advanced/counterFlowFlame2D_KE/GT_Files/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="$(getApplication)"
echo $application

runApplication blockMesh
runApplication reactingFoam

#------------------------------------------------------------------------------
